import 'package:flutter/material.dart';

const Color backroundGrey = Color.fromRGBO(230, 230, 230, 1);
const Color greenMain = Color.fromRGBO(49, 160, 98, 1);

const bool userLogedIn = false;

const double iconInputSize = 26;

const MaterialColor primaryGreen =
    MaterialColor(_primaryGreenPrimaryValue, <int, Color>{
  50: Color(0xFFE6F4EC),
  100: Color(0xFFC1E3D0),
  200: Color(0xFF98D0B1),
  300: Color(0xFF6FBD91),
  400: Color(0xFF50AE7A),
  500: Color(_primaryGreenPrimaryValue),
  600: Color(0xFF2C985A),
  700: Color(0xFF258E50),
  800: Color(0xFF1F8446),
  900: Color(0xFF137334),
});
const int _primaryGreenPrimaryValue = 0xFF31A062;

const MaterialColor primaryGreenAccent =
    MaterialColor(_primaryGreenAccentValue, <int, Color>{
  100: Color(0xFFA9FFC4),
  200: Color(_primaryGreenAccentValue),
  400: Color(0xFF43FF7D),
  700: Color(0xFF2AFF6B),
});
const int _primaryGreenAccentValue = 0xFF76FFA0;

String licenceAgreement = """ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ
в отношении приложения «NA Beauty Bar»
1. Настоящее Пользовательское соглашение (далее «Соглашение») определяет порядок отношений между ТОО «NA Beauty Bar» (далее «Компания»), и любым дееспособным физическим лицом, надлежащим образом, присоединившимся к настоящему Соглашению (далее - «Пользователь»).
2. Предметом настоящего Соглашения являются условия использования мобильного приложения Компании Пользователем. Компания предоставляет Пользователям личное неисключительное и непередаваемое право безвозмездно использовать мобильное приложение «NA Beauty Bar» для мобильных операционных систем Android и iOS при соблюдении условий настоящего Соглашения.
3. Условия настоящего Соглашения считаются публичной офертой по смыслу ст. 395 Гражданского кодекса Республики Казахстан, в связи с чем настоятельно рекомендуем ознакомиться с условиями Соглашения перед использованием Приложения.
4. Если Вы не принимаете условия настоящей публичной оферты в полном объёме, Вы не имеете права использовать приложение «NA Beauty Bar» в каких-либо целях.
5. Настоящее Соглашение является открытым и общедоступным документом. Действующая редакция Соглашения располагается в сети Интернет по адресу: https://docs.google.com/document/d/1aeaHV3Um91dMiLmRLvUnZyVdNnLjrn1uBmOQwyr_sRk


ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ
В настоящем документе и вытекающих или связанных с ним отношениях Сторон применяются следующие термины и определения:
Соглашение настоящий документ со всеми дополнениями, изменениями и указанными в нем обязательными документами, а также договор, заключенный на его основании.
Пользователь любое дееспособное физическое или юридическое лицо, принявшее условия данного Соглашения и пользующееся услугами Компании;
Администрация должностные лица Компании, уполномоченные надлежащим образом Компанией на управление Мобильным приложением и предоставление Услуг Посетителям, в рамках использования Приложений.
Мобильное приложение предназначенная для установки и использования на Устройстве программа для ЭВМ, позволяющая Пользователю получить доступ к информации с использованием сети связи. Устройство планшет, мобильный телефон, коммуникатор, смартфон, иное устройство, позволяющее использовать Приложение и/или Сервис по их функциональному назначению.
Контент изображения, текстовые, аудио- и видеоматериалы, а также прочие объекты авторских и (или) смежных прав, а равно не являющиеся таковыми информация и сообщения любого характера.
Профиль персональный раздел Приложения, к которому Пользователь получает доступ после прохождения регистрации и/или авторизации в Приложении. Личный кабинет предназначен для хранения персональных данных Пользователя, просмотра и управления доступными функциональными возможностями Приложения и соответствующими условиями использования Приложения.
В настоящем Соглашении могут быть использованы иные термины и определения, не указанные в этом разделе. В этом случае толкование такого термина производится в соответствии с текстом Соглашения. В случае отсутствия однозначного толкования термина или определения в тексте Соглашения и иных документов, образующих договор на условиях Соглашения, следует руководствоваться его толкованием, определенным: в первую очередь – законодательством Республики Казахстан, и в последующем – обычаями делового оборота и научной доктриной.


1. СТАТУС ПОЛЬЗОВАТЕЛЬСКОГО СОГЛАШЕНИЯ
1.1. При условии соблюдения Пользователем настоящих условий, Компания предоставляет Пользователю ограниченное не исключительное, не подлежащее передаче, безвозмездное право загрузить, установить и использовать приложение «NA Beauty Bar» на устройстве, которым Пользователь владеет и/или которое контролирует, и пользоваться такой копией приложения исключительно в личных целях.
1.2. Любое использование/ совершение любых действий с Приложением «NA Beauty Bar», (включая регистрацию в Приложении на мобильном устройстве Пользователя, отправка Заявки с указанием контактного телефона, звонок по контактным телефонам Компании, указанным на Приложении и иные) выражает согласие и полное и безоговорочное принятие Пользователем условий настоящей оферты, что является ее акцептом и считается равносильным заключению договора на изложенных в данном Соглашении условиях, при этом письменная форма настоящего договора считается соблюденной.
1.3. В момент совершения Пользователем Акцепта оферты, Пользователь и Компания считаются заключившими настоящее Соглашение.
1.4. Пользователь несет ответственность за соблюдение прав (материальных и нематериальных) третьих лиц на информацию, переданную (предоставленную) Администрации или третьим лицам при использовании Приложений. Пользователи самостоятельно оценивают правомерность использования ими Приложений, в том числе и с точки зрения законодательства страны, резидентами которой они являются.
1.5. Настоящее соглашение об использовании мобильного приложения заключаемое в форме публичной оферты, предусмотрено Гражданским Кодексом Республики Казахстан, не требует двустороннего подписания и действительно в электронном виде.
1.6. Настоящее Соглашение составлено в соответствии с законодательством Республики Казахстан. Вопросы, не урегулированные Соглашением, подлежат разрешению в соответствии с законодательством Республики Казахстан.
1.7. Соглашаясь с условиями настоящего Соглашения, Пользователь подтверждает свою правоспособность и свою дееспособность.


2. ПРАВА И ОБЯЗАННОСТИ
2.1. Компания:
2.1.1. Предоставляет Пользователю право функционального использования Приложения в пределах его общих функциональных возможностей.
2.1.3. Не гарантирует бесперебойную, безошибочную работу Сервиса, не гарантирует соответствие Сервиса и Информации целям и ожиданиям Пользователя.
2.1.4. Вправе показывать рекламные сообщения
2.1.5. Вправе использовать, обрабатывать Пользовательскую информацию в порядке предусмотренном разделом 6
2.1.6. Вправе в любой момент полностью или частично изменить содержание пользовательского соглашения без предварительного уведомления Пользователей.
2.1.7. Без уведомления Пользователя и без объяснения причин в любое время заблокировать доступ к профилю в мобильном приложении
2.1.8. Устанавливать ограничения в использовании функционала приложения для одного или всех пользователей
2.1.9. Без уведомления пользователей производить обновления, изменять внешний вид, функционал сервиса.

3.2. Пользователь имеет право на просмотр аудиовизуальных произведений, фотографий размещенных в мобильном приложении «NA Beauty Bar», доступных для такого просмотра в соответствии с настоящим Соглашением;
3.3. Пользователю при использовании Приложения запрещается:
3.3.1. регистрироваться в качестве Пользователя от имени или вместо другого лица («фиктивная анкета»);
3.3.2. вводить Администрацию в заблуждение относительно своей личности, используя данные карты лояльности другого зарегистрированного Пользователя;
3.3.3. искажать сведения о себе;
3.3.6. использовать программное обеспечение и осуществлять действия, направленные на нарушение нормального функционирования Приложения
3.3.7. любым способом, в том числе, но не ограничиваясь, путем обмана, злоупотребления доверием, взлома, пытаться получить доступ к данным других Пользователей;

4. ОГРАНИЧЕНИЕ ОТВЕТСТВЕННОСТИ КОМПАНИИ
4.1. Пользователи самостоятельно несут ответственность за свои действия/бездействие при использовании Приложения. Пользователи гарантируют, что использование Приложения будет осуществляться ими таким образом, который не будет нарушать права третьих лиц, законодательства РК.
4.2. Пользователи обязуются соблюдать настоящее Соглашение. При нарушении Пользователями Соглашения Администрация оставляет за собой право временно ограничить доступ Пользователя к Приложению, а в случае неоднократного нарушения Соглашения отказать в доступе к Приложению.
4.3. Компания ни при каких обстоятельствах не несёт ответственности перед Пользователями
4.4. Компания не несет ответственности за неполадки в работе Приложения, вызванные техническими перебоями в работе оборудования и программного обеспечения.


5. ИНТЕЛЛЕКТУАЛЬНЫЕ ПРАВА
5.1. Объекты с элементом дизайна размещенные в рамках Приложения, являются объектами исключительных прав Компании.
5.2. Использование Приложения иными способами, в том числе путем копирования (воспроизведения) размещенного в Приложении Контента, а также входящих в состав Приложения элементов дизайна, программ для ЭВМ и баз данных, их декомпиляция, модификация, и последующее распространение, публичный показ, доведение до всеобщего сведения, строго запрещены, если иное не предусмотрено настоящим Соглашением.
5.3. Пользователь не вправе воспроизводить, повторять и копировать, продавать, а также использовать для каких-либо коммерческих целей какие-либо части Приложений (включая Контент, доступный Пользователю посредством Приложения), или доступ к ним, кроме тех случаев, когда Пользователь получил такое разрешение от Компании
5.4. Ничто в настоящем Соглашении не может быть истолковано как передача Пользователю или иным третьим лицам при содействии Пользователя прав по копированию/изменению Приложений; по созданию программ, производных от программного обеспечения Приложений; по проникновению в программное обеспечение с целью получения кодов программ; по осуществлению продажи, уступки, сдачи в аренду, передачи третьим лицам в любой иной форме прав в отношении материала Приложений и программного обеспечения Приложений; по модифицированию Приложений в том числе с целью получения несанкционированного доступа к нему; и иных действий, аналогичных перечисленным выше и нарушающих права Компании и третьих лиц.

6. ЗАЩИТА ДАННЫХ
6.1. Принимая условия настоящего Соглашения, Пользователь подтверждает свое полное согласие на обработку Компанией его персональных данных, представленных в Приложении, в целях исполнения настоящего Соглашения и разрешения претензий, связанных с исполнением настоящего Соглашения.
6.2. Для авторизации доступа к Приложению используется номер телефона. Ответственность за сохранность данной информации несет Пользователь.
6.3. Используя мобильное приложение, и/или иные связанные сервисы и инструменты «NA Beauty Bar», Пользователь предоставляет своё согласие Компании на обработку своих персональных данных, таких как имя пользователя; регион проживания, адрес электронной почты, контактный телефон, другая контактная информация, а также даёт своё согласие на передачу своих персональных данных третьим лицам, в том числе на передачу персональных данных за границу, в любую третью страну, в случае обеспечения этими странами защиты персональных данных.
6.4. Для оказания своих услуг Компания может использовать информацию, которую Компания собирает и размещает для следующих целей:
6.5. обеспечение обслуживания клиентов, в том числе для создания и управления учетными записями пользователей, решения технических трудностей и доступа к различным функциям;
6.6. адаптация предложений и опыта, в том числе рекламы на своих сервисах или сервисах третьих лиц;
6.7. связь с Пользователями, в том числе по вопросам сервиса, обслуживания клиентов или разрешенных маркетинговых коммуникаций через любые доступные каналы связи;
6.8. проведение научно-исследовательской и аналитической активности с целью улучшения нашего сервиса;
6.8. обеспечение соблюдения Пользовательского соглашения, включая борьбу с мошенничеством
6.9 Компания может сохранять информацию, которую она собирает и получает так долго, как то требуется для выполнения вышеуказанных деловых целей.
6.10. Компания принимает технические и организационно-правовые меры в целях обеспечения защиты данных Пользователя от неправомерного или случайного доступа к ним, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий. Аффилированные с Компанией лица, надежные партнеры и сторонние поставщики услуг обязуются использовать полученную от Компании информацию в соответствии с нашими требованиями к безопасности и этой Политикой Конфиденциальности.

7. СРОК ДЕЙСТВИЯ СОГЛАШЕНИЯ И ПРЕКРАЩЕНИЕ ОКАЗАНИЯ УСЛУГ
7.1. Пользователь имеет право прекратить использования приложения в одностороннем порядке, без предварительного уведомления об этом Компании и объяснения причин.
7.2. Настоящее Соглашение может быть изменено и/или дополнено Компанией в одностороннем порядке. При этом продолжение использования Приложения после внесения изменений и/или дополнений в настоящее Соглашение, означает согласие Пользователя с такими изменениями и/или дополнениями, в связи с чем Пользователь обязуется регулярно отслеживать изменения в Соглашении, размещенном по адресу: https://docs.google.com/document/d/1aeaHV3Um91dMiLmRLvUnZyVdNnLjrn1uBmOQwyr_sRk
7.3. Правоотношения могут быть возобновлены только после принятия администрацией Компании соответствующего решения.

9. РАЗРЕШЕНИЕ СПОРОВ
9.1. Обращения, предложения и претензии физических и юридических лиц к Компании, связанные с содержанием и функционированием Приложения, нарушениями прав и интересов третьих лиц, требований законодательства Республики Казахстан, а также для запросов уполномоченных законодательством Республики Казахстан лиц могут быть направлены на адрес электронной почты: nabeautybar1@gmail.com
«NA Beauty Bar» © 2024
Все права защищены

 """;
